
## :x: Apply Failed

[CI link](https://github.com/goda6565/portfolio/actions/runs/15206667615)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main]
module.cloudrun_service.google_cloud_run_v2_service_iam_member.public_access: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main/roles/run.invoker/allUsers]
module.cloudrun_domain_map.google_cloud_run_domain_mapping.default: Refreshing state... [id=locations/asia-northeast1/namespaces/portfolio-460206/domainmappings/goodyfolio.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloud_dns.google_dns_managed_zone.example-zone will be created
  + resource "google_dns_managed_zone" "example-zone" {
      + creation_time    = (known after apply)
      + description      = "Managed by Terraform"
      + dns_name         = "goodyfolio.com."
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "goodyfolio-com-zone"
      + name_servers     = (known after apply)
      + project          = "portfolio-460206"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "public"

      + cloud_logging_config {
          + enable_logging = true
        }

      + dnssec_config {
          + kind          = "dns#managedZoneDnsSecConfig"
          + non_existence = (known after apply)
          + state         = "on"

          + default_key_specs (known after apply)
        }
    }

  # module.cloudrun_domain_map.google_cloud_run_domain_mapping.default is tainted, so must be replaced
-/+ resource "google_cloud_run_domain_mapping" "default" {
      ~ id       = "locations/asia-northeast1/namespaces/portfolio-460206/domainmappings/goodyfolio.com" -> (known after apply)
        name     = "goodyfolio.com"
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = "com.google.net.rpc3.RpcException: Caller is not authorized to administer the domain goodyfolio.com. If you own goodyfolio.com, you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com')."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Certificate will not be provisioned unless the domain is made routable."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = "com.google.net.rpc3.RpcException: Caller is not authorized to administer the domain goodyfolio.com. If you own goodyfolio.com, you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com')."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "DomainRoutable"
                    },
                ]
              - observed_generation = 1
              - resource_records    = []
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations           = {} -> null
          ~ effective_annotations = {
              - "run.googleapis.com/operation-id"  = "4f7dba52-6348-4eb4-b672-75a47caa2adb"
              - "serving.knative.dev/creator"      = "terraform-executor@portfolio-460206.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "terraform-executor@portfolio-460206.iam.gserviceaccount.com"
            } -> (known after apply)
          ~ effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1" -> null
                # (1 unchanged element hidden)
            }
          ~ generation            = 1 -> 0
          - labels                = {} -> null
          ~ resource_version      = "AAY1ybDQ5io" -> (known after apply)
          ~ self_link             = "/apis/domains.cloudrun.com/v1/namespaces/186242794041/domainmappings/goodyfolio.com" -> (known after apply)
          ~ uid                   = "63ff9c71-d930-4c05-a3e0-a2a2565c35a6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
          - force_override   = false -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
module.cloudrun_domain_map.google_cloud_run_domain_mapping.default: Destroying... [id=locations/asia-northeast1/namespaces/portfolio-460206/domainmappings/goodyfolio.com]
module.cloud_dns.google_dns_managed_zone.example-zone: Creating...
module.cloudrun_domain_map.google_cloud_run_domain_mapping.default: Destruction complete after 1s
module.cloudrun_domain_map.google_cloud_run_domain_mapping.default: Creating...
╷
│ Error: Error creating ManagedZone: googleapi: Error 403: Cloud DNS API has not been used in project portfolio-460206 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/dns.googleapis.com/overview?project=portfolio-460206 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.ErrorInfo",
│     "domain": "googleapis.com",
│     "metadata": {
│       "activationUrl": "https://console.developers.google.com/apis/api/dns.googleapis.com/overview?project=portfolio-460206",
│       "consumer": "projects/portfolio-460206",
│       "containerInfo": "portfolio-460206",
│       "service": "dns.googleapis.com",
│       "serviceTitle": "Cloud DNS API"
│     },
│     "reason": "SERVICE_DISABLED"
│   },
│   {
│     "@type": "type.googleapis.com/google.rpc.LocalizedMessage",
│     "locale": "en-US",
│     "message": "Cloud DNS API has not been used in project portfolio-460206 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/dns.googleapis.com/overview?project=portfolio-460206 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry."
│   },
│   {
│     "@type": "type.googleapis.com/google.rpc.Help",
│     "links": [
│       {
│         "description": "Google developers console API activation",
│         "url": "https://console.developers.google.com/apis/api/dns.googleapis.com/overview?project=portfolio-460206"
│       }
│     ]
│   }
│ ]
│ , accessNotConfigured
│ 
│   with module.cloud_dns.google_dns_managed_zone.example-zone,
│   on ../../modules/cloud_dns/google_dns_managed_zone.tf line 1, in resource "google_dns_managed_zone" "example-zone":
│    1: resource "google_dns_managed_zone" "example-zone" {
│ 
╵
╷
│ Error: Error waiting to create DomainMapping: resource is in failed state "Ready:False", message: com.google.net.rpc3.RpcException: Caller is not authorized to administer the domain goodyfolio.com. If you own goodyfolio.com, you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com').
│ 
│   with module.cloudrun_domain_map.google_cloud_run_domain_mapping.default,
│   on ../../modules/cloudrun_domain_map/google_cloud_run_domain_mapping.tf line 1, in resource "google_cloud_run_domain_mapping" "default":
│    1: resource "google_cloud_run_domain_mapping" "default" {
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":36,"Program":"tfcmt","SHA1":"614f03dccd4807a23162c559931b7a1f295bce7b","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->